emacs.d.symlink/init.org
** Backups
#+BEGIN_SRC emacs-lisp
;; Backup everything to the same directory, rather than dropping
;; files all over the place
(setq backup-directory-alist
      `(("." . ,(md/dotfiles-get-path "emacs.d.symlink/.backups"))))
#+END_SRC
** Paste

If this isn't set then pasting via Alfred doesnt work:

#+BEGIN_SRC emacs-lisp
  (defun md/pbpaste ()
    (interactive)
    (shell-command "pbpaste" t))

    (if (eq window-system 'ns)
      (global-set-key (kbd "M-v") 'md/pbpaste))
#+END_SRC
* Misc utils
** Odd functions

#+BEGIN_SRC emacs-lisp
  (defun md/strip-whitespace-and-save ()
    (interactive)
    (delete-trailing-whitespace)
    (save-buffer))

  (defun md/fontify-buffer ()
    "Fontify the buffer and tell me it happened."
    (interactive)
    (font-lock-fontify-buffer)
    (message "Fontified buffer"))

  (defun md/file-info ()
    (interactive)
    (message
     "%s | %s lines | %3d%% | %s"
             (buffer-file-name)
             (count-lines (point-min) (point-max))
             (/ (window-end) 0.01 (point-max))
             major-mode))

  (defun md/mode-info ()
    (interactive)
    (message
     (format
      "%s"
      (with-temp-buffer
        (let (mm result)
          (dolist (mm (sort minor-mode-list 'string<) result)
            (insert (format "%s\n" mm))
            (setq result (buffer-substring (point-min) (point-max))))
          result)))))

  (defun md/ljust (len str)
    (if (< (length str) len)
        ;; 32 is ASCII space
        (concat str (make-string (- len (length str)) 32))
      str))

#+END_SRC

It's a shame that "unfill" functions aren't included by default, but they're
easy enough to implement:

#+BEGIN_SRC emacs-lisp
  (defun md/unfill-paragraph ()
    "Because I can't always wrap to 80 characters :("
    (interactive)
    (let ((fill-column most-positive-fixnum))
      (fill-paragraph)))

  (defun md/unfill-region (start end)
    (interactive "r")
    (let ((fill-column most-positive-fixnum))
      (fill-region start end)))
#+END_SRC

** Bindings
I seem to use =describe-face= a lot:
#+BEGIN_SRC emacs-lisp
(bind-key "x" 'describe-face help-map)
(bind-key "C-k" 'describe-personal-keybindings help-map)
#+END_SRC

Sometimes I want to strip bindings from a keymap and have the keys do
nothing. Usually if you remove a binding on eg. a local keymap, then Emacs will
just resolve that binding to a more global keymap. But I can "disable" bindings
by using a noop function:

#+BEGIN_SRC emacs-lisp
  (defun md/noop () (interactive))
  (defun md/make-keymap-noop (kmap)
    "Overwrite bindings on a given keymap to perform a noop function."
    (mapc (lambda (key)
            (bind-key key 'md/noop kmap)
            (bind-key (concat "C-" key) 'md/noop kmap)
            (bind-key (concat "M-" key) 'md/noop kmap)
            (bind-key (concat "C-M-" key) 'md/noop kmap)
            (bind-key (capitalize key) 'md/noop kmap)
            (bind-key (concat "C-" (capitalize key)) 'md/noop kmap)
            (bind-key (concat "M-" (capitalize key)) 'md/noop kmap)
            (bind-key (concat "C-M-" (capitalize key)) 'md/noop kmap))
          '("a" "b" "c" "d" "e" "f" "g" "h" "i" "j" "k" "l" "m" "n" "o" "p" "q" "r"
            "s" "t" "u" "v" "w" "x" "y" "z"
            "1" "2" "3" "4" "5" "6" "7" "8" "9" "0"))
    (mapc (lambda (key)
            (bind-key key 'md/noop kmap))
          '("SPC" "TAB")))
#+END_SRC

** Settings
#+BEGIN_SRC emacs-lisp
  (setq delete-by-moving-to-trash t)
#+END_SRC
* Evil
