emacs.d.symlink/init.el

;; Backup everything to the same directory, rather than dropping
;; files all over the place
(setq backup-directory-alist
      `(("." . ,(md/dotfiles-get-path "emacs.d.symlink/.backups"))))

(defun md/pbpaste ()
  (interactive)
  (shell-command "pbpaste" t))

  (if (eq window-system 'ns)
    (global-set-key (kbd "M-v") 'md/pbpaste))

(defun md/strip-whitespace-and-save ()
  (interactive)
  (delete-trailing-whitespace)
  (save-buffer))

(defun md/fontify-buffer ()
  "Fontify the buffer and tell me it happened."
  (interactive)
  (font-lock-fontify-buffer)
  (message "Fontified buffer"))

(defun md/file-info ()
  (interactive)
  (message
   "%s | %s lines | %3d%% | %s"
           (buffer-file-name)
           (count-lines (point-min) (point-max))
           (/ (window-end) 0.01 (point-max))
           major-mode))

(defun md/mode-info ()
  (interactive)
  (message
   (format
    "%s"
    (with-temp-buffer
      (let (mm result)
        (dolist (mm (sort minor-mode-list 'string<) result)
          (insert (format "%s\n" mm))
          (setq result (buffer-substring (point-min) (point-max))))
        result)))))

(defun md/ljust (len str)
  (if (< (length str) len)
      ;; 32 is ASCII space
      (concat str (make-string (- len (length str)) 32))
    str))

(defun md/unfill-paragraph ()
  "Because I can't always wrap to 80 characters :("
  (interactive)
  (let ((fill-column most-positive-fixnum))
    (fill-paragraph)))

(defun md/unfill-region (start end)
  (interactive "r")
  (let ((fill-column most-positive-fixnum))
    (fill-region start end)))

(bind-key "x" 'describe-face help-map)
(bind-key "C-k" 'describe-personal-keybindings help-map)

(setq debug-on-error nil)
(setq delete-by-moving-to-trash t)

(use-package evil
 :demand t
 :config
 (progn
