emacs.d.symlink/init.el
    ;; Putting these bindings here to avoid byte-compiled issue where helm-map isn't defined.
    (helm-mode 1)
    (helm-autoresize-mode 0)
    (helm-descbinds-mode 1)

    ;; No need to display the header - it takes up room and doesn't add much.
    (setq helm-display-header-line nil)

    ;; I don't need to know about some files
    ;; TODO get this to workj
    (setq helm-ff-skip-boring-files t)
    (push "\\.$" helm-boring-file-regexp-list)
    (push "\\.\\.$" helm-boring-file-regexp-list)

    ;; This lets me quickly ag/grep for "todo" comments using the same
    ;; ag/grep functions that I usually do.
    (bind-key "C-c C-t" 'md/insert-todo-regexp helm-map)

    ;; Put C-j / C-l the sane way around.
    (bind-key "C-j" 'helm-find-files-up-one-level helm-map)
    (bind-key "C-l" 'helm-execute-persistent-action helm-map)
    (bind-key "C-l" 'helm-execute-persistent-action helm-read-file-map)
    (bind-key "C-l" 'helm-execute-persistent-action helm-find-files-map))

  :bind (([remap find-file] . helm-find-files)  ; Remember - this also opens URLs!
         ([remap occur] . helm-occur)
         ([remap dabbrev-expand] . helm-dabbrev)
         ([remap list-buffers] . helm-buffers-list)
         ("M-x" . helm-M-x)
         ("C-x b" . helm-buffers-list)
         ("C-x p" . helm-mini)

         :map lisp-interaction-mode-map
         ([remap completion-at-point] . helm-lisp-completion)

         :map emacs-lisp-mode-map
         ([remap completion-at-point] . helm-lisp-completion)

         :map md/leader-map
         ("bb" . helm-buffers-list)
         ("f" . helm-find-files)
         ("x" . helm-M-x)
         ("p" . helm-mini)

         :map help-map
         ("X" . helm-colors)))

(use-package help-fns+ :defer 1)

(evil-set-initial-state 'help-mode 'normal)
(evil-define-key 'normal help-mode-map
  "q" 'quit-window
  (kbd "C-i") 'help-go-forward
  (kbd "C-o") 'help-go-back
  (kbd "<RET>") 'help-follow-symbol)

(defun md/which-key-patch ()
  "Override some which-key functions"
  (interactive)

(fmakunbound 'which-key--show-keymap)
(defun which-key--show-keymap (keymap-name keymap &optional prior-args)
  "This is identical to the version shipped with which-key, but it returns the
function captured by user input."
  (setq which-key--current-prefix nil
        which-key--current-show-keymap-name keymap-name
        which-key--using-show-keymap t)
  (when prior-args (push prior-args which-key--prior-show-keymap-args))
  (when (keymapp keymap)
    (let ((formatted-keys (which-key--get-formatted-key-bindings
                           (which-key--get-keymap-bindings keymap))))
      (cond ((= (length formatted-keys) 0)
             (message "which-key: Keymap empty"))
            ((listp which-key-side-window-location)
             (setq which-key--last-try-2-loc
                   (apply #'which-key--try-2-side-windows
                          formatted-keys 0 which-key-side-window-location)))
            (t (setq which-key--pages-plist
                     (which-key--create-pages formatted-keys))
               (which-key--show-page 0)))))
  (let* ((key (key-description (list (read-key))))
         (next-def (lookup-key keymap (kbd key))))
    (cond ((and which-key-use-C-h-commands (string= "C-h" key))
           (which-key-C-h-dispatch))
          ((keymapp next-def)
           (which-key--hide-popup-ignore-command)
           (setq next-def (which-key--show-keymap (concat keymap-name " " key) next-def
                                   (cons keymap-name keymap))))
          (t (which-key--hide-popup)))
    next-def))

) ; Close md/which-key-patch

;; TODO There are some bindings that do not show up.
;; Eg. the C-x prefix displayed does not exactly match the real C-x prefix map
;; (eg. M-: repeat-complex-command is missing).
(defun md/get-all-active-bindings-as-keymap ()
  "Return keymap consisting of bindings in all active keymaps. This should
represent all current available bindings accurately as a single keymap."
  (let ((full-active-keymap (make-sparse-keymap)))
    (mapc (lambda (keymap)
            ;; Ignore empty keymaps
            (when (not (equal keymap (make-sparse-keymap)))
              (map-keymap (lambda (event definition)
                            (when (md/include-event-in-active-map event definition)
                              (define-key full-active-keymap
                                (vector event) definition)))
                          keymap)))
          ;; Reverse so that the keymaps with highest precendence
          ;; are written last, thus overriding the more global maps.
          (reverse (current-active-maps t)))
    full-active-keymap))

(defun md/include-event-in-active-map (event definition)
  "Placeholder"
  (and
   (not (equal definition 'digit-argument))))
