emacs.d.symlink/init.org
*** Config

#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :defer 2
    :config (progn
              ;; Patch with my functions
              (md/which-key-patch)

              (setq which-key-idle-delay 0.6
                    which-key-max-description-length 30
                    which-key-allow-evil-operators nil
                    which-key-show-operator-state-maps nil
                    which-key-sort-order 'which-key-key-order-alpha
                    which-key-highlighted-command-list '("md/"))

              ;; Use ESC/C-g to quit which-key. Not sure why the default key is 'a'.
              (bind-key "ESC" 'which-key-abort which-key-C-h-map)
              (bind-key "C-g" 'which-key-abort which-key-C-h-map)

              ;; This is the default for description-replacement-alist:
              (setq which-key-description-replacement-alist
                    '(("Prefix Command" . "prefix")
                      ("which-key-show-next-page" . "wk next pg")
                      ("\\`\\?\\?\\'" . "lambda")))

              ;; Add scratch bindings:
              (dolist (mode '("elisp" "python" "restclient" "markdown" "gfm" "org"))
                (add-to-list 'which-key-description-replacement-alist
                             (cons (format "md/scratch-open-file-%s" mode) mode)))

              (which-key-declare-prefixes
                "SPC SPC" "major-mode"
                "SPC SPC e" "major-mode-eval"
                "SPC a" "ag"
                "SPC b" "buffers"
                "SPC B" "bookmarks"
                "SPC c" "comments"
                "SPC C" "compile"
                "SPC e" "eval"
                "SPC E" "Emacs"
                "SPC F" "Format"
                "SPC g" "git"
                "SPC h" "help"
                "SPC h k" "keys"
                "C-h k" "keys"
                "SPC h h" "helpful"
                "C-h h" "helpful"
                "SPC j" "project"
                "SPC j ;" "project-popwin"
                "SPC j a" "project-ag"
                "SPC n" "narrow"
                "SPC P" "Packages"
                "SPC s" "flycheck"
                "SPC S" "flyspell"
                "SPC t" "toggle-misc"
                "SPC v" "dotfiles"
                "SPC ;" "popwin"
                "SPC '" "scratch")
              (which-key-mode)

              (defun md/which-key ()
                "Use the which-key interface to list all active bindings and execute the
      current one. One prefix arg will pre-select the current evil-state in which-key,
      and two prefix args will let you choose an evil state to pre-select."
                (interactive)
                (catch 'no-evil-state-map
                  (let* ((md-evil-state (cond ((equal current-prefix-arg '(4))
                                               (md/which-key--evil-state-current))
                                              ((equal current-prefix-arg '(16))
                                               (md/which-key--evil-state-select))))
                         (evil-keymap nil)
                         (base-keymap (md/get-all-active-bindings-as-keymap))
                         (final-keymap
                          (if md-evil-state
                              (progn
                                (message "evil state!")
                                (setq evil-keymap (lookup-key base-keymap md-evil-state))
                                (if (keymapp evil-keymap)
                                    evil-keymap
                                  (throw 'no-evil-state-map
                                         (format "No available bindings for evil state %s" md-evil-state))))
                            base-keymap))
                         (chosen-func (which-key--show-keymap "All active bindings" final-keymap)))
                    (when (commandp chosen-func)
                      (message (format "calling interactively: %s" chosen-func))
                      (call-interactively chosen-func)))))


              (defconst md/which-key--evil-states '(normal-state
                                                    insert-state
                                                    visual-state
                                                    motion-state
                                                    replace-state
                                                    emacs-state))

              (defun md/which-key--evil-state-select ()
                "Return (kbd-for-state . local-keymap) for chosen Evil state"
                (kbd (format "<%s>" (completing-read "Evil state: " md/which-key--evil-states nil
                                                     t))))

              (defun md/which-key--evil-state-current ()
                "Return (kbd-for-state . local-keymap) for current Evil state"
                (kbd (format "<%s-state>" evil-state)))

              ))
#+END_SRC

** List unbound keys

This is handy sometimes - it provides ~free-keys~, which lists unbound keys.

#+BEGIN_SRC emacs-lisp
  (use-package free-keys
    :defer 10
    :config
      (progn
        (bind-key "@" 'free-keys help-map)))
#+END_SRC
** Key functions
#+BEGIN_SRC emacs-lisp
  (defvar md/keys-help-map (make-sparse-keymap))

  (bind-key "k" md/keys-help-map help-map)

  (bind-key "k" 'describe-key md/keys-help-map)
  (bind-key "K" 'describe-keymap md/keys-help-map)
  (bind-key "p" 'describe-personal-keybindings md/keys-help-map)
  (bind-key "@" 'free-keys md/keys-help-map)
  (bind-key "SPC" 'md/which-key md/keys-help-map)

  (global-set-key (kbd "C-SPC") 'md/which-key) 

  ;; Setting this mode on replaces describe-bindings, and
  ;; loads helm-descbinds.el, which I might want to use elsewhere.
  (add-hook 'helm-descbinds-mode-hook
            (lambda () (bind-key "b" 'helm-descbinds md/keys-help-map)))
#+END_SRC
* General IDE features
** Grep/ag
#+BEGIN_SRC emacs-lisp
  (use-package ag
    :config
    (progn
      (evil-add-hjkl-bindings 'ag-mode-map
        (kbd "SPC") 'md/leader-map)

      (setq ag-context-lines nil
            ag-highlight-search t
            ag-reuse-buffers t  ; Only one buffer for ag searches§
            ag-reuse-window nil))  ; Open files in new window, don't hide search window

    :bind (:map md/leader-map
                ("ad" . ag-dired)
                ("af" . ag-files)
                ("ag" . ag)
                ("/" . occur)))
#+END_SRC
** Autocompletion

Company seems to work nicely without much configuration.

#+BEGIN_SRC emacs-lisp
  (use-package company
    :defer 2
    :config
    (progn
      ;; Bind here rather than in ":bind" to avoid complaints about
      ;; company-mode-map not existing.
      (bind-key "C-n" 'company-select-next company-active-map)
      (bind-key "C-p" 'company-select-previous company-active-map)

      ;; By default this performs company-complete-common, but I don't
      ;; think I'll want to use that
      (bind-key "TAB" 'company-complete-selection company-active-map)

      (bind-key "C-n" 'company-complete evil-insert-state-map)

      (global-company-mode)))
#+END_SRC

