emacs.d.symlink/init.org
** Flycheck
#+BEGIN_SRC emacs-lisp
  (use-package flycheck
    :init
    (progn
      (add-hook 'prog-mode-hook 'flycheck-mode))
    :config
    (progn
      (defface md/modeline-flycheck-error '((t (:inherit 'error))) "")
      (defface md/modeline-flycheck-warning '((t (:inherit 'warning))) "")

      (setq-default flycheck-disabled-checkers

            ;; Most of these elisp warnings assume that I'm writing a proper package
            ;; with full documentation. This is usually not the case, so just
            ;; disable them.
            '(emacs-lisp-checkdoc))

      (setq flycheck-flake8rc ".config/flake8"
            flycheck-highlighting-mode 'symbols

            ;; defaults to 0.9, which is too slow
            flycheck-display-errors-delay 0.1

            ;; Disabling this at is annoys me to have errors appearing
            ;; and disappearing quickly and messing with the size of the
            ;; window. I will just check the error list and the fringe.
            flycheck-display-errors-function nil

            ;; There's a short delay when flycheck runs, which causes the modeline to change
            ;; its format (or in my custom powerline stuff, to disappear briefly). It's
            ;; super annoying if this happens at random points during editing, so change it
            ;; to only happen on save (and when enabling the mode). This is quite similar to how
            ;; I had it setup in vim.
            flycheck-check-syntax-automatically '(save mode-enabled)

            flycheck-mode-line-prefix nil)

      ;; For some reason in the flycheck mode list map it just uses all vi
      ;; keys. Mostly this is fine but I need an easy way to quit.
      (evil-define-key 'normal flycheck-error-list-mode-map "q" 'quit-window))
    :bind (:map md/leader-map
                ;; S prefix, ie. "syntax"
                ("s <RET>" . flycheck-mode)
                ("sl" . flycheck-list-errors)
                ("sn" . flycheck-next-error)
                ("sj" . flycheck-next-error)
                ("sp" . flycheck-previous-error)
                ("sk" . flycheck-previous-error)
                ("S <RET>" . flyspell-mode)
                ("SS" . flyspell-correct-word-before-point)))

#+END_SRC

** Projectile
*** Base projectile
#+BEGIN_SRC emacs-lisp
  (use-package projectile
    :config
    (progn
      (setq projectile-file-exists-local-cache-expire 30
            projectile-enable-caching t
            projectile-globally-ignored-file-suffixes
            '("pyc"
              "png"
              "jpg"
              "gif"
              "zip"
              "Trash"
              "swp"
              "swo"
              "DS_Store"
              "swn"
              "ico"
              "o"
              "elc"
              "a"
              "so"
              "exe"
              "egg-info"
              "egg"
              "dmg")
            projectile-globally-ignored-directories
            '(".tmp"
              ".coverage"
              ".git"
              ".hg"
              ".idea"
              ".flsckout"
              ".bzr"
              "_darcs"
              ".tox"
              ".svn"
              ".egg"
              ".egg-info"
              ".sass-cache"
              "__pycache__"
              ".webassets-cache"
              "node_modules"
              "venv"
              "elpa"
              ".stack-work"))
      (projectile-global-mode))
    :bind (:map md/leader-map
                ("j!"  . projectile-invalidate-cache)
                ("jk"  . projectile-kill-buffers)
                ("j;t" . projectile-run-term)
                ("j;d" . projectile-dired)
                ("j;s" . projectile-run-shell)
                ("j;e" . projectile-run-eshell)))
#+END_SRC

*** Helm
#+BEGIN_SRC emacs-lisp
  (use-package helm-projectile
    :init (progn
            ;; This has to be set before loading helm-projectile
            (setq helm-projectile-fuzzy-match nil))
    :bind (:map md/leader-map
                ("jj" . helm-projectile-switch-project)
                ("jag" . projectile-ag)
                ("jaf" . ag-project-files)
                ("jad" . ag-project-dired)
                ("jb" . helm-projectile-switch-to-buffer)
                ("jp" . helm-projectile-switch-to-buffer)
                ("jf" . helm-projectile-find-file)))
#+END_SRC

*** COMMENT Popwin

Sometimes I want popwin buffers to be dedicated to a project, so I can have
eg. one terminal popwin per project.

#+BEGIN_SRC emacs-lisp
  (defun md/projectile-popwin-ansi-term ()
    "Open project-dedicated ansi-term buffer in popwin. Renames the term buffer to
  match the project."
    (interactive)
    (when popwin:focus-window (popwin:close-popup-window))
    (popwin:display-buffer
     (or (get-buffer (format "*ansi-term-(%s)*" (projectile-project-name)))
          (save-window-excursion
            (with-current-buffer
              (call-interactively 'projectile-run-term)
              (rename-buffer
               (format "*ansi-term-(%s)*" (projectile-project-name))))))))

  (defun md/projectile-popwin-shell ()
    "Open project-dedicated shell buffer in popwin. Renames the term buffer to
  match the project."
    (interactive)
    (when popwin:focus-window (popwin:close-popup-window))
    (popwin:display-buffer
     (or (get-buffer (format "*shell-(%s)*" (projectile-project-name)))
          (save-window-excursion
            (with-current-buffer
              (call-interactively 'projectile-run-shell)
              (rename-buffer
               (format "*shell-(%s)*" (projectile-project-name))))))))

  (defun md/projectile-popwin-eshell ()
    "Open project-dedicated eshell buffer in popwin. Renames the term buffer to
  match the project."
    (interactive)
    (when popwin:focus-window (popwin:close-popup-window))
    (popwin:display-buffer
     (or (get-buffer (format "*eshell-(%s)*" (projectile-project-name)))
          (save-window-excursion
            (with-current-buffer
              (call-interactively 'projectile-run-eshell)
              (rename-buffer
               (format "*eshell-(%s)*" (projectile-project-name))))))))

  (bind-key "j;t" 'md/projectile-popwin-ansi-term md/leader-map)
  (bind-key "j;s" 'md/projectile-popwin-shell md/leader-map)
  (bind-key "j;e" 'md/projectile-popwin-eshell md/leader-map)

#+END_SRC

** Git
*** git-commit

I sometimes see issues where git opens emacsclient in Fundamental mode. Making
~global-git-commit-mode~ explicit in an attempt to resolve this:

#+BEGIN_SRC emacs-lisp
  (use-package git-commit
    :config
    (global-git-commit-mode t))
#+END_SRC

*** git-gutter
#+BEGIN_SRC emacs-lisp
  (use-package git-gutter
   :init
   (progn
     (defun md/set-sensible-column ()
       "Unless file is too big, either use git-gutter mode (when in
  git dir) or linum mode"
       (interactive)
       (when (and (< (count-lines (point-min) (point-max)) 1500)
                  (not (eq major-mode 'org-mode)))
         (if (string= "git" (downcase (format "%s" (vc-backend
                                                    (buffer-file-name
                                                     (current-buffer))))))
             (git-gutter-mode 1))))
     (add-hook 'find-file-hook 'md/set-sensible-column))
   :config
   (progn
     (setq git-gutter:ask-p nil  ; Don't ask for confirmation of gadd
           git-gutter:modified-sign "~"
           git-gutter:added-sign "+"
           git-gutter:deleted-sign "-"

           ;; This ensures the separator is always displayed
           git-gutter:unchanged-sign " "
           git-gutter:always-show-separator t

           ;; Without this, there's no space between the git-gutter column and the code.
           git-gutter:separator-sign " "))
   :bind (:map md/leader-map
         ("g <RET>" . git-gutter-mode)
         ("gk" . git-gutter:previous-hunk)
         ("gp" . git-gutter:previous-hunk)
         ("gj" . git-gutter:next-hunk)
         ("gn" . git-gutter:next-hunk)
         ("g+" . git-gutter:stage-hunk)
         ("g-" . git-gutter:revert-hunk)))

#+END_SRC

