emacs.d.symlink/init.org
*** magit
#+BEGIN_SRC emacs-lisp
  (use-package magit
   :config
   (progn
     (evil-set-initial-state 'magit-blame-mode 'normal)
     (evil-set-initial-state 'magit-revision-mode 'normal)

     ;; I don't know why, but by default I can't get magit-blame to adhere to my
     ;; normal-mode map below, even though Evil says I'm in normal mode. Explicitly
     ;; calling evil-normal-state fixes it.
     (add-hook 'magit-blame-mode-hook 'evil-normal-state)
     (evil-define-key 'normal magit-blame-mode-map
       (kbd "<RET>") 'magit-show-commit
       "q" 'magit-blame-quit
       "gj" 'magit-blame-next-chunk
       "gn" 'magit-blame-next-chunk
       "gk" 'magit-blame-previous-chunk
       "gp" 'magit-blame-previous-chunk)

     (add-hook 'magit-revision-mode-hook 'evil-normal-state)
     (evil-define-key 'normal magit-revision-mode-map
       (kbd "<RET>") 'magit-diff-visit-file
       "q" 'magit-mode-bury-buffer))  ;; This quits

   :bind (:map md/leader-map
         ("gg" . magit-status)
         ("gm" . magit-dispatch-popup)
         ("gb" . magit-blame)
         ("gl" . magit-log-head)

         ;; Diff gives the full git diff output. Ediff shows ediff for a single
         ;; file.
         ("gd" . magit-diff-popup)
         ("gD" . magit-ediff-popup)

         ;; NOTE - this doesn't play nicely with mode-line:
         ;; - https://github.com/magit/magit/blob/master/Documentation/magit.org#the-mode-line-information-isnt-always-up-to-date
         ;; - https://github.com/syl20bnr/spacemacs/issues/2172
         ("gc" . magit-checkout)))

#+END_SRC

*** github-browse-file

I miss :Gbrowse from fugitive:

#+BEGIN_SRC emacs-lisp
  (use-package github-browse-file
    :config
    (progn
      (setq github-browse-file-show-line-at-point t))
    :bind (:map md/leader-map
          ("go" . github-browse-file)))
#+END_SRC

*** vc-mode
#+BEGIN_SRC emacs-lisp
  ;; I don't need to confirm this via prompt.
  (setq vc-follow-symlinks t)
#+END_SRC

** Ediff

- Add evil bindings to ediff. Largely copied from https://github.com/justbur/evil-ediff/blob/master/evil-ediff.el.

#+BEGIN_SRC emacs-lisp
  (use-package ediff
   :defer 1
   :config
   (progn

     (defun md/ediff-scroll-left ()
       (interactive)
       (let ((last-command-event ?>))
         (ediff-scroll-horizontally 1)))

     (defun md/ediff-scroll-right ()
       (interactive)
       (let ((last-command-event ?<))
         (ediff-scroll-horizontally 1)))

     (defun md/ediff-scroll-up ()
       (interactive)
       (let ((last-command-event ?V))
         (ediff-scroll-vertically 1)))

     (defun md/ediff-scroll-down ()
       (interactive)
       (let ((last-command-event ?v))
         (ediff-scroll-vertically 1)))

     (setq
      ;; Horizontal instead of vertical splits.
      ediff-split-window-function 'split-window-horizontally

      ;; Make sure the ediff control window is NOT opened in a new frame.
      ediff-window-setup-function 'ediff-setup-windows-plain)

     (defvar md/ediff-help-changed nil)
     (defun md/ediff-adjust-help ()
       "Adjust long help messages to reflect evil-ediff bindings."
       (unless md/ediff-help-changed
         (dolist (msg '(ediff-long-help-message-compare2
                        ediff-long-help-message-compare3
                        ediff-long-help-message-narrow2
                        ediff-long-help-message-word-mode
                        ediff-long-help-message-merge
                        ediff-long-help-message-head
                        ediff-long-help-message-tail))
           (dolist (chng '(("p,DEL -previous diff " . " gk,p -previous diff ")
                           ("n,SPC -next diff     " . " gj,n -next diff     ")
                           ("    h -highlighting  " . "    H -highlighting  ")
                           ("    j -jump to diff  " . "    d -jump to diff  ")
                           ("  </> -scroll lt/rt  " . "  h/l -scroll lt/rt  ")
                           ("  v/V -scroll up/dn  " . "  k/j -scroll up/dn  ")
                           ("  z/q -suspend/quit  " . "  q/z -quit/suspend  ")))
             (setf (symbol-value msg)
                   (replace-regexp-in-string (car chng) (cdr chng) (symbol-value msg))))))
       (setq md/ediff-help-changed t))

     (defvar md/ediff-bindings
       '(("h" . md/ediff-scroll-left)
         ("j" . md/ediff-scroll-down)
         ("k" . md/ediff-scroll-up)
         ("l" . md/ediff-scroll-right)
         ("gj" . ediff-next-difference)
         ("gk" . ediff-previous-difference)
         ("d" . ediff-jump-to-difference)
         ("H" . ediff-toggle-hilit)
         ("q" . ediff-quit)))

     (defun md/ediff-startup-hook ()
       (evil-make-overriding-map ediff-mode-map 'normal)
       (dolist (entry md/ediff-bindings)
         (define-key ediff-mode-map (car entry) (cdr entry)))
       (evil-normalize-keymaps))

     ;; Override bindings
    (evil-set-initial-state 'ediff-mode 'normal)
    (add-hook 'ediff-startup-hook 'md/ediff-startup-hook)
    (md/ediff-adjust-help)

    ;; Ensure that outline buffers are expanded when in ediff mode, because
    ;; it doesn't automatically expand them, even if the diffs are inside a
    ;; hidden headline.
    (add-hook 'ediff-prepare-buffer-hook 'outline-show-all))

   :bind (:map md/leader-map
               ("d" . ediff)))
#+END_SRC
** Highlight keywords in comments

#+BEGIN_SRC emacs-lisp
(use-package fic-mode
 :defer 1
 :init
 (progn
   (add-hook 'prog-mode-hook 'fic-mode))
 :config
 (progn
   ;; NOTE: fic-mode doesn't seem to fontify the buffer, so words don't appear
   ;; highlighted unless either something else fontifies the buffer, or we do it
   ;; manually. Would like to improve this.
   ;;
   ;; FIX: fic-mode doesn't seem to identify words on the same line as my cursor
   ;; when I change theme and then fontify the buffer. All other lines seem fine.

   (setq fic-highlighted-words
         '("TODO" "FIX" "FIXME" "BUG" "WARN" "WARNING" "HACK" "NOTE" "ERROR" "MATT"))

   ;; By default this includes font-lock-string-face, but I don't want strings to
   ;; have these words formatted.
   (setq fic-activated-faces '(font-lock-doc-face font-lock-comment-face))))
#+END_SRC

I can use this with grep/ag to quickly find the todo comments:
#+BEGIN_SRC emacs-lisp
  (defun md/insert-todo-regexp ()
    (interactive)
    (insert "TODO|FIX|FIXME|BUG|WARN|HACK|ERROR"))
#+END_SRC
** Highlight thing

#+BEGIN_SRC emacs-lisp
  (use-package highlight-thing
    :defer 5
    :config
    (progn
      (setq highlight-thing-delay-seconds 0.2
            highlight-thing-case-sensitive-p t)
      (add-hook 'prog-mode-hook 'highlight-thing-mode))
    :bind (:map md/leader-map
                ("tt" . highlight-thing-mode)))
#+END_SRC

** Parentheses
Basic paren matching is built in. I preferred these settings at one point,
although I don't remember exactly what the difference is:

#+BEGIN_SRC emacs-lisp
  (use-package paren
   :defer 1
   :init (progn
          (add-hook 'prog-mode-hook 'show-paren-mode))
   :config
   (progn
     (setq show-paren-style 'parenthesis
           blink-matching-paren nil
           blink-matching-paren-on-screen nil)))
#+END_SRC

** Colour hex values
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-mode
    :defer 1
    :config
    (progn
       (add-hook 'css-mode-hook 'rainbow-mode)
       (add-hook 'help-mode-hook 'rainbow-mode)
       (add-hook 'html-mode-hook 'rainbow-mode))
    :bind (:map md/leader-map
                ("tr" . rainbow-mode)))
#+END_SRC

** COMMENT Folding

#+BEGIN_SRC emacs-lisp
  ;; outline-magic provides org-cycle
  (use-package outline-magic
    :demand t
    :config
    (progn
      ;; TODO - any way to support narrowing? org-narrow-to-subtree works in
      ;; outline mode, but move-subtree-up/down don't work properly when narrowed.

      (add-hook 'prog-mode-hook 'outline-minor-mode)

      (defun md/outline-cycle-all ()
        (interactive)
        (let ((current-prefix-arg '(4))) ;; emulate C-u
          (call-interactively 'outline-cycle)))

      (defun md/outline-next-heading ()
        "Automatically move point to first word beyond any leading whitespace"
        (interactive)
        (outline-next-visible-heading 1)
        (back-to-indentation))

      (defun md/outline-previous-heading ()
        "Automatically move point to first word beyond any leading whitespace"
        (interactive)
        (outline-previous-visible-heading 1)
        (back-to-indentation))

      (setq outline-blank-line nil)
      (evil-define-key 'normal outline-minor-mode-map
        (kbd "<tab>") 'outline-cycle
        (kbd "S-<tab>") 'md/outline-cycle-all
        "gk" 'md/outline-previous-heading
        "gj" 'md/outline-next-heading
        (kbd "M-k") 'outline-move-subtree-up
        (kbd "M-j") 'outline-move-subtree-down)

      ;; TODO - add decorator support?
      (defun md/outline-minor-mode-python ()
        (interactive)
        (setq-local outline-regexp
                    (rx-to-string
                     '(group (* space)
                             (* "#")
                             (* space)
                             bow
                             (or "class" "def")
                             ))))
      (add-hook 'python-mode-hook 'md/outline-minor-mode-python)
      ))
#+END_SRC
* Applications
