emacs.d.symlink/init.org
** Dired
Dired mode has a lot of features / keys that I don't care about. Start it in
evil mode, and just add in the dired bindings that I want.

#+BEGIN_SRC emacs-lisp
  (use-package dired
    :demand t
    :init
    (progn
       ;; Use human size
       (setq dired-listing-switches "-alh")

      ;; evil-integrations.el (https://github.com/emacsmirror/evil/blob/cd005aa50ab056492752c319b5105c38c79c2fd0/evil-integration.el#L111)
      ;; makes dired-mode-map an overriding keymap, which means that the default
      ;; dired-mode bindings take precendence over the normal-state bindings.
      ;;
      ;; There's no obvious way to undo that code, so I'm just replacing
      ;; dired-mode-map with a new keymap that has /not/ been made 'overriding'.
      (setq dired-mode-map (make-sparse-keymap))

      (defun md/dired-single-buffer ()
        "If in popwin buffer, open dired in popwin. Otherwise as usual."
        (interactive)
        (if popwin:focus-window
            (progn
              (save-window-excursion (call-interactively 'dired-single-buffer))
              (popwin:close-popup-window)
              (popwin:display-buffer (get-buffer dired-single-magic-buffer-name)))
          (dired-single-buffer)))

      (evil-define-key 'normal dired-mode-map
        "W" 'wdired-change-to-wdired-mode  ; This is v useful
        "q" 'quit-window
        "d" 'dired-flag-file-deletion
        "u" 'dired-unmark
        "D" 'dired-do-delete
        (kbd "RET") 'dired-single-buffer
        "J" 'dired-jump
        "o" 'dired-find-file-other-window
        "R" 'dired-do-rename
        "C" 'dired-do-copy
        "i" 'dired-maybe-insert-subdir
        "+" 'dired-create-directory)))
#+END_SRC

*** Dired-single

I don't use Dired much and would prefer it to be contained to fewer buffers.
Would like this to work with popwin, but currently pressing RET on a directory
causes it to jump out of the popwin window.

#+BEGIN_SRC emacs-lisp
(use-package dired-single
  :demand t)

#+END_SRC

** Restclient
For 80% of use-cases, I think [[https://github.com/pashky/restclient.el][restclient]] will be more convenient than Postman.

#+BEGIN_SRC emacs-lisp
  (use-package restclient
    :defer 1
    :mode (("\\.http\\'" . restclient-mode)))

  (use-package restclient-helm :defer 5)
#+END_SRC

Add company completion for restclient:

#+BEGIN_SRC emacs-lisp
  (use-package company-restclient
    :config
    (progn
        (add-to-list 'company-backends 'company-restclient)))
#+END_SRC

#+BEGIN_EXAMPLE
POST https://httpbin.org/post

This is the body
#+END_EXAMPLE
* Languages
** Emacs-lisp
#+BEGIN_SRC emacs-lisp
  (setq debug-on-error nil)

  ;; This can be useful when debugging.
  (setq edebug-trace t)

  ;; https://github.com/ScottyB/edebug-x
  ;; https://lists.gnu.org/archive/html/emacs-devel/2013-03/msg00304.html
  ;;
  ;; Provides some enhancements to edebug mode. Doesn't look like it is
  ;; maintained, but it's useful even if just for the syntax highlighting.
  (use-package edebug-x)
#+END_SRC

Override the edebug keymap to only contain features/keys that I care about:

#+BEGIN_SRC emacs-lisp
  (add-hook 'edebug-mode-hook 'evil-normal-state)
  (md/make-keymap-noop edebug-mode-map)

  (bind-key "q" 'top-level edebug-mode-map)
  (bind-key "S" 'edebug-stop edebug-mode-map)
  (bind-key "n" 'edebug-step-mode edebug-mode-map)
  (bind-key "g" 'edebug-go-mode edebug-mode-map)
  (bind-key "G" 'edebug-Go-nonstop-mode edebug-mode-map)
  (bind-key "E" 'edebug-visit-eval-list edebug-mode-map)
  (bind-key "I" 'edebug-instrument-callee edebug-mode-map)
  (bind-key "i" 'edebug-step-in edebug-mode-map)
  (bind-key "o" 'edebug-step-out edebug-mode-map)
  (bind-key "b" 'edebug-set-breakpoint edebug-mode-map)
  (bind-key "u" 'edebug-unset-breakpoint edebug-mode-map)
  (bind-key "d" 'edebug-backtrace edebug-mode-map)
  (bind-key "r" 'edebug-previous-result edebug-mode-map)
  (bind-key "w" 'edebug-where edebug-mode-map)
  (bind-key "SPC" md/leader-map edebug-mode-map)
#+END_SRC

** COMMENT Python

Elpy combines a few different Python packages / features.

#+BEGIN_SRC emacs-lisp
  (use-package elpy
    :defer 1  ;; Defer this just because it's slow to load.
    :init
    (progn
      (add-hook 'elpy-mode-hook
                (lambda ()
                  (set (make-local-variable 'company-backends) '(elpy-company-backend)))))
    :config
    (progn
      (elpy-enable)

      ;; - Remove elpy-module-flymake because I already have flymake configured.
      ;; - Remove elpy-module-highlight indentation because it's distracting.
      (setq elpy-modules (list
                          'elpy-module-sane-defaults
                          'elpy-module-company
                          'elpy-module-eldoc
                          'elpy-module-pyvenv
                          'elpy-module-yasnippet))

      (setq elpy-rpc-backend "jedi")

      ;; Setup leader map for python
      (evil-define-key 'normal python-mode-map
        (kbd "SPC") md/python-mode-leader-map
        "gk" 'python-nav-backward-defun
        "gj" 'python-nav-forward-defun)

      (evil-define-key 'insert elpy-mode-map (kbd "C-n") 'elpy-company-backend)

      (if (string= major-mode "python-mode")
        (progn
          ;; If I've opened a Python file make sure everything loads properly
          ;; on this buffer.
          (python-mode)
          (elpy-mode 1))))

    :bind (:map md/python-mode-leader-map
                ("SPC v" . pyvenv-workon)
                ("SPC V" . pyvenv-activate)
                ("SPC f" . elpy-format-code)
                ("SPC t" . elpy-test)
                ("SPC d" . elpy-doc)
                ("SPC g" . elpy-goto-definition-other-window)
                ("SPC r" . elpy-multiedit-python-symbol-at-point)))

#+END_SRC

** Golang
#+BEGIN_SRC emacs-lisp
  (when (not (getenv "GOPATH"))
   (setenv "GOPATH" "/Users/matt/golang") 
   (setenv "GO15VENDOREXPERIMENT" "1"))

  (use-package go-mode
    :config
    (progn
      (add-hook 'before-save-hook 'gofmt-before-save)

      ;; Make sure SPC uses the go-mode leader map rather than my default leader
      ;; map
      (evil-define-key 'normal go-mode-map
        (kbd "SPC") md/go-mode-leader-map))

    :bind (:map md/go-mode-leader-map
                ("SPC =" . gofmt)))

  (use-package company-go
    :init
    (progn
      (add-hook 'go-mode-hook
                (lambda ()
                  (set (make-local-variable 'company-backends) '(company-go))))))

#+END_SRC

** MIT Scheme

- [ ] mit-scheme leader map
- [ ] ef / ee / er bindings
#+BEGIN_SRC emacs-lisp

  (use-package scheme
    :config
    (progn
      ;; For SICP
      (setq scheme-program-name "/usr/local/bin/mit-scheme")

      ;; Setup leader map for this major mode
      (evil-define-key 'normal scheme-mode-map
        (kbd "SPC") md/scheme-mode-leader-map)
      (evil-define-key 'visual scheme-mode-map
        (kbd "SPC") md/scheme-mode-leader-map)

      ;; When I run the "send-to" functions I want to see the results
      ;; in the popwin window
      (defun md/scheme--eval (fn)
        (save-window-excursion
          (call-interactively 'run-scheme))
          (call-interactively fn)
        (popwin:display-buffer (get-buffer "*scheme*")))

      (defun md/scheme-send-last-sexp ()
        (interactive)
        (md/scheme--eval 'scheme-send-last-sexp))

      (defun md/scheme-send-region ()
        (interactive)
        (md/scheme--eval 'scheme-send-region))

      (defun md/scheme-send-defun ()
        (interactive)
        (md/scheme--eval 'scheme-send-definition)))

    :bind (:map md/scheme-mode-leader-map
                ("SPC ee" . md/scheme-send-last-sexp)
                ("SPC ef" . md/scheme-send-defun)
                ("SPC er" . md/scheme-send-region)))
#+END_SRC
** Yaml
Not sure if this provides anything beyond syntax highlighting, but that's enough
for now:

#+BEGIN_SRC emacs-lisp
  (use-package yaml-mode)
#+END_SRC

** Lua

#+BEGIN_SRC emacs-lisp
  (use-package lua-mode)
#+END_SRC

** Terraform
Not sure if this provides anything beyond syntax highlighting, but that's enough
for now:

#+BEGIN_SRC emacs-lisp
  (use-package terraform-mode)
#+END_SRC

** Web mode
This makes working with HTML/CSS/JS files much nicer. TODO - read documentation
/ configure.

#+BEGIN_SRC emacs-lisp
(use-package web-mode
  :defer 1)

#+END_SRC

** Markdown

AFAICT markdown syntax highlighting isn't provided by default. [[https://github.com/jrblevin/markdown-mode][Markdown mode]]
includes highlighting, plus some extra features like inserting elements and
compiling. It also includes ~gfm-mode~ for Github-flavoured markdown.

NOTE - compiling requires ~markdown~ to be installed.

#+BEGIN_SRC emacs-lisp
  (use-package markdown-mode
    :commands (markdown-mode gfm-mode)
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.gfm\\'" . gfm-mode)
           ("\\.md\\'" . markdown-mode)
           ("\\.apib\\'" . markdown-mode)  ; Apiary
           ("\\.markdown\\'" . markdown-mode))
    :config (progn
              ;; Markdown-cycle behaves like org-cycle, but by default is only
              ;; enabled in insert mode. gfm-mode-map inherits from
              ;; markdown-mode-map, so this will enable it in both.
              (evil-define-key 'normal markdown-mode-map 
                (kbd "TAB") 'markdown-cycle
                "gk" 'markdown-previous-visible-heading
                "gj" 'markdown-next-visible-heading)))


          

#+END_SRC
** Coffeescript
#+BEGIN_SRC emacs-lisp
(use-package coffee-mode)
#+END_SRC
* Window manager
** Elscreen

Elscreen provides "tabs" that let me sort of arrange windows how I did it in
vim. They're not ideal though, because the tabs either appear in several places
on the screen, or nowhere.

#+BEGIN_SRC emacs-lisp
  (use-package elscreen
   :defer 1
   :config
   (progn
     (defun md/elscreen-display-tabs ()
       (interactive)
       (setq elscreen-display-tab t
             elscreen-tab-display-kill-screen nil
             elscreen-tab-display-control nil)

       ;; This is how elscreen redraws
       (elscreen-notify-screen-modification 'force))

     (md/elscreen-display-tabs)))
#+END_SRC

** Splitscreen
#+BEGIN_SRC emacs-lisp
(setq md/splitscreen-path (md/dotfiles-get-path "splitscreen/"))

;; NOTE - for some reason this doesn't seem to load with "defer"
(use-package splitscreen
 :load-path md/splitscreen-path
 :demand t
 :config
 (progn
   (splitscreen-mode)
   (bind-key "C-w" splitscreen/mode-map edebug-mode-map)))
#+END_SRC

