emacs.d.symlink/init.el
     (setq dired-listing-switches "-alh")

    ;; evil-integrations.el (https://github.com/emacsmirror/evil/blob/cd005aa50ab056492752c319b5105c38c79c2fd0/evil-integration.el#L111)
    ;; makes dired-mode-map an overriding keymap, which means that the default
    ;; dired-mode bindings take precendence over the normal-state bindings.
    ;;
    ;; There's no obvious way to undo that code, so I'm just replacing
    ;; dired-mode-map with a new keymap that has /not/ been made 'overriding'.
    (setq dired-mode-map (make-sparse-keymap))

    (defun md/dired-single-buffer ()
      "If in popwin buffer, open dired in popwin. Otherwise as usual."
      (interactive)
      (if popwin:focus-window
          (progn
            (save-window-excursion (call-interactively 'dired-single-buffer))
            (popwin:close-popup-window)
            (popwin:display-buffer (get-buffer dired-single-magic-buffer-name)))
        (dired-single-buffer)))

    (evil-define-key 'normal dired-mode-map
      "W" 'wdired-change-to-wdired-mode  ; This is v useful
      "q" 'quit-window
      "d" 'dired-flag-file-deletion
      "u" 'dired-unmark
      "D" 'dired-do-delete
      (kbd "RET") 'md/dired-single-buffer
      "J" 'dired-jump
      "o" 'dired-find-file-other-window
      "R" 'dired-do-rename
      "C" 'dired-do-copy
      "i" 'dired-maybe-insert-subdir
      "+" 'dired-create-directory)))

(use-package dired-single
  :demand t)

(use-package restclient
  :defer 1
  :mode (("\\.http\\'" . restclient-mode)))

(use-package restclient-helm :defer 5)

(use-package company-restclient
  :config
  (progn
      (add-to-list 'company-backends 'company-restclient)))

(when (not (getenv "GOPATH"))
 (setenv "GOPATH" "/Users/matt/golang") 
 (setenv "GO15VENDOREXPERIMENT" "1"))

(use-package go-mode
  :config
  (progn
    (add-hook 'before-save-hook 'gofmt-before-save)

    ;; Make sure SPC uses the go-mode leader map rather than my default leader
    ;; map
    (evil-define-key 'normal go-mode-map
      (kbd "SPC") md/go-mode-leader-map))

  :bind (:map md/go-mode-leader-map
              ("SPC =" . gofmt)))

(use-package company-go
  :init
  (progn
    (add-hook 'go-mode-hook
              (lambda ()
                (set (make-local-variable 'company-backends) '(company-go))))))

(use-package scheme
  :config
  (progn
    ;; For SICP
    (setq scheme-program-name "/usr/local/bin/mit-scheme")

    ;; Setup leader map for this major mode
    (evil-define-key 'normal scheme-mode-map
      (kbd "SPC") md/scheme-mode-leader-map)
    (evil-define-key 'visual scheme-mode-map
      (kbd "SPC") md/scheme-mode-leader-map)

    ;; When I run the "send-to" functions I want to see the results
    ;; in the popwin window
    (defun md/scheme--eval (fn)
      (save-window-excursion
        (call-interactively 'run-scheme))
        (call-interactively fn)
      (popwin:display-buffer (get-buffer "*scheme*")))

    (defun md/scheme-send-last-sexp ()
      (interactive)
      (md/scheme--eval 'scheme-send-last-sexp))

    (defun md/scheme-send-region ()
      (interactive)
      (md/scheme--eval 'scheme-send-region))

    (defun md/scheme-send-defun ()
      (interactive)
      (md/scheme--eval 'scheme-send-definition)))

  :bind (:map md/scheme-mode-leader-map
              ("SPC ee" . md/scheme-send-last-sexp)
              ("SPC ef" . md/scheme-send-defun)
              ("SPC er" . md/scheme-send-region)))

(use-package yaml-mode)

(use-package lua-mode)

(use-package terraform-mode)

(use-package web-mode
  :defer 1)

(use-package markdown-mode
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.gfm\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.apib\\'" . markdown-mode)  ; Apiary
         ("\\.markdown\\'" . markdown-mode))
  :config (progn
            ;; Markdown-cycle behaves like org-cycle, but by default is only
            ;; enabled in insert mode. gfm-mode-map inherits from
            ;; markdown-mode-map, so this will enable it in both.
            (evil-define-key 'normal markdown-mode-map 
              (kbd "TAB") 'markdown-cycle
              "gk" 'markdown-previous-visible-heading
              "gj" 'markdown-next-visible-heading)))

(use-package coffee-mode)

(use-package elscreen
 :defer 1
 :config
 (progn
   (defun md/elscreen-display-tabs ()
     (interactive)
     (setq elscreen-display-tab t
           elscreen-tab-display-kill-screen nil
           elscreen-tab-display-control nil)

     ;; This is how elscreen redraws
     (elscreen-notify-screen-modification 'force))

   (md/elscreen-display-tabs)))

(setq md/splitscreen-path (md/dotfiles-get-path "splitscreen/"))

;; NOTE - for some reason this doesn't seem to load with "defer"
(use-package splitscreen
 :load-path md/splitscreen-path
 :demand t
 :config
 (progn
   (splitscreen-mode)))
