emacs.d.symlink/init.el

(use-package popwin
  :demand t
  :config
  (progn
    (defun md/popwin-toggle ()
      "Either close popwin or open it in its last buffer"
      (interactive)
      (if popwin:focus-window
          (popwin:close-popup-window)
        (popwin:display-last-buffer)))

    (defun md/popwin-org ()
      (interactive)
      (when popwin:focus-window (popwin:close-popup-window))
      (if (get-buffer "index.org")
          (popwin:display-buffer "index.org")
        (message "No buffer: index.org")))

    (defun md/popwin-scratch ()
      (interactive)
      (when popwin:focus-window (popwin:close-popup-window))
      (popwin:display-buffer "*scratch*"))

    (defun md/popwin-messages ()
      (interactive)
      (when popwin:focus-window (popwin:close-popup-window))
      (popwin:display-buffer "*Messages*"))

    (defun md/popwin-ansi-term ()
      "Copied from
https://github.com/m2ym/popwin-el/blob/master/misc/popwin-term.el. For some
reason this is necessary to open term in a popwin window. Shell and eshell work
out of the box."
      (interactive)
      (when popwin:focus-window (popwin:close-popup-window))
      (popwin:display-buffer
       (or (get-buffer "*ansi-term*")
           (save-window-excursion
             (call-interactively 'ansi-term)))))

    (defun md/popwin-eshell ()
      (interactive)
      (when popwin:focus-window (popwin:close-popup-window))
      (popwin:display-buffer
       (or (get-buffer "*eshell*")
           (save-window-excursion
             (call-interactively 'eshell)))))

    (defun md/popwin-dired-single-magic-buffer ()
      (interactive)
      (when popwin:focus-window (popwin:close-popup-window))
      (popwin:display-buffer
       (or (get-buffer dired-single-magic-buffer-name)
           (save-window-excursion
             (call-interactively 'dired-single-magic-buffer)))))

    ;; Disable popwin-mode in an active Helm session, to prevent it from conflicting
    ;; with Helm windows. Also ensure that popwin-last-config doesn't return
    ;; helm buffers.
    (defvar md/popwin-last-config nil)
    (add-hook 'helm-before-initialize-hook
              (lambda ()
                (when popwin:focus-window (progn (popwin:close-popup-window)))))
    (add-hook 'helm-after-initialize-hook
              (lambda ()
                (setq md/popwin-last-config-store popwin:popup-last-config)
                (popwin:display-buffer helm-buffer t)
                (popwin-mode -1)
                ))
    (add-hook 'helm-cleanup-hook (lambda ()
                                   (popwin-mode 1)
                                   (setq popwin:popup-last-config md/popwin-last-config-store)))
    (push '("^\*helm.+\*$" :regexp t :dedicated nil :height 15) popwin:special-display-config)

    (setq popwin:popup-window-height 10)

    ;; TODO why isn't dired working? Judging by the examples it should, but
    ;; dired buffers just appear in their own windows. Tried on 24.5 and 25.1.
    (push '(dired-mode :dedicated t :height 20 :stick t) popwin:special-display-config)

    ;; NOTE: `:dedicated t` means matching buffers will reuse the same window.
    ;; Generally I only ever want one popwin window open.
    (push '("*Messages*" :tail t :dedicated t) popwin:special-display-config)
    (push '("index.org" :height 20 :dedicated t :stick t) popwin:special-display-config)
    (push '(help-mode :dedicated t :stick t :height 25) popwin:special-display-config)
    (push '("^\\*scratch\\*$" :regexp t :dedicated t :stick t) popwin:special-display-config)
    (push '("^\\*Flycheck.+\\*$" :regexp t :dedicated t :stick t :noselect t) popwin:special-display-config)
    (push '("*Messages*" :tail t :dedicated t) popwin:special-display-config)
    (push '("*Warnings*" :tail t :dedicated t) popwin:special-display-config)
    (push '("*Backtrace*" :dedicated t) popwin:special-display-config)
    (push '(completion-list-mode :noselect t :dedicated t) popwin:special-display-config)
    (push '(compilation-mode :noselect t :stick t :dedicated t :tail t) popwin:special-display-config)
    (push '(grep-mode :noselect t :dedicated t) popwin:special-display-config)
    (push '(ag-mode :noselect t :dedicated t :stick t :tail nil :height 15) popwin:special-display-config)
    (push '(occur-mode :noselect t :dedicated t :stick t) popwin:special-display-config)
    (push '("*vc-change-log*" :dedicated t) popwin:special-display-config)
    (push '("*undo-tree*" :width 60 :position right :dedicated t) popwin:special-display-config)
    (push '("*HTTP Response*" :height 20 :dedicated t :stick t :noselect t) popwin:special-display-config)
    (push '("*Shell Command Output*" :dedicated t :tail t) popwin:special-display-config)
    (push '("*Async Shell Command*" :dedicated t :tail t) popwin:special-display-config)
    (push '(shell-mode :regexp t :dedicated t :height 15 :stick t :tail t) popwin:special-display-config)
    (push '(eshell-mode :regexp t :dedicated t :height 15 :stick t :tail t) popwin:special-display-config)
    (push '(term-mode :dedicated t :height 15 :stick t :tail t)
          popwin:special-display-config)  ; only works with md/popwin-ansi-term
    (push '(inferior-scheme-mode :dedicated t :height 15 :stick t :tail t) popwin:special-display-config)

    (popwin-mode 1))
  :bind (:map md/leader-map
              ;; I can't get arbitrary buffers/files to play nicely, so
              ;; just have the dedicated buffers.
              (";a" . md/popwin-toggle)
              (";d" . md/popwin-dired-single-magic-buffer)
              (";i" . md/popwin-org)
              (";s" . md/popwin-scratch)
              (";t" . md/popwin-ansi-term)
              (";e" . md/popwin-eshell)
              (";m" . md/popwin-messages)))

(use-package org
  :defer 5
  :config
  (progn
