emacs.d.symlink/init.org
** Shackle (https://github.com/mattduck/shackle)

Shackle has a lot of overlap with Popwin, ie. I can force certain applications
into smaller windows on the side of the screen - Flycheck, terminals, help, etc.
I'm trying it as it looks like there are some advantages:

- Easier to read the codebase / implementation.

- Popwin isn't maintained.

- Shackle rules apply whenever ~display-buffer-alist~ is used, which makes it
  (1) more generalised and (2) predictable. I had some issues with Popwin not
  displaying certain buffers that looked awkward to debug.
  
Shackle didn't support "sticky" type windows out of the box, but it was easy to
add the ~:close-on-realign~ flag to simulate this behaviour.

#+BEGIN_SRC emacs-lisp
  (use-package shackle
    :load-path "non-elpa/shackle"  ; fork
    :demand t
    :config
    (progn

      (defun md/shackle-down ()
        (interactive)
        (delete-window shackle-last-window))

      (defun md/shackle-up ()
        (interactive)
        (if shackle-last-buffer
            (display-buffer shackle-last-buffer)
          (message "No previous shackle buffer found")))

      (defun md/shackle-toggle ()
        (interactive)
        (if (window-live-p shackle-last-window)
            (md/shackle-down)
          (md/shackle-up)))

      ;; NOTE: This might solve the Popwin issues I had with not picking up some
      ;; buffers, eg. Dired.
      (defun md/use-display-buffer-alist (fn &rest args)
        "Wrap a function that displays a buffer. Save window excursion, and
    re-display the new buffer using `display-buffer`, which allows Shackle to
    detect and process it. "
        (let ((buffer-to-display nil)
              (res nil))
          (save-window-excursion
            (setq res (apply fn args))
            (setq buffer-to-display (current-buffer)))
          (display-buffer buffer-to-display)
          res))

      (defmacro md/shackle-advise (fn)
        "Add advise to given function to wrap with md/shackle-wrapper."
        `(advice-add ,fn :around 'md/use-display-buffer-alist
                     '((name . "md/shackle"))))

      ;; Add advice for functions that display a new buffer but usually escape
      ;; Shackle (eg. due to not calling display-buffer).
      (md/shackle-advise 'helpful-function)
      (md/shackle-advise 'helpful-command)
      (md/shackle-advise 'helpful-macro)
      (md/shackle-advise 'ansi-term)
      (md/shackle-advise 'term)
      (md/shackle-advise 'eshell)
      (md/shackle-advise 'shell)
      (md/shackle-advise 'dired)
      (md/shackle-advise 'dired-jump)
      (md/shackle-advise 'projectile-run-term)
      (md/shackle-advise 'undo-tree-visualize)
      (md/shackle-advise 'run-scheme)

      (setq shackle-rules
            '(("\\`\\*helm.*?\\*\\'" :regexp t :align t :close-on-realign t :size 15 :select t)
              ("\\`\\*help.*?\\*\\'" :regexp t :align t :close-on-realign t :size 0.33 :select t)
              ('helpful-mode :align t :close-on-realign t :size 0.33 :select t)
              ("\\`\\*Flycheck.*?\\*\\'" :regexp t :align t :close-on-realign t :size 12 :select nil)
              ("\\`\\*Shell Command Output.*?\\*\\'" :regexp t :align t :close-on-realign t :size 12 :select nil)
              ("\\`\\*Async Shell Command.*?\\*\\'" :regexp t :align t :close-on-realign t :size 12 :select nil)
              ('undo-tree-visualizer-mode :align right :close-on-realign t :size 30 :select t)
              ("\\`\\*Directory.*?\\*\\'" :regexp t :align t :close-on-realign t :size 12 :select t)
              ("\\`\\*vc-change-log.*?\\*\\'" :regexp t :align t :close-on-realign t :size 0.33 :select nil)
              ("*edebug-trace*" :align t :close-on-realign t :size 15 :select nil)
              ("\\`\\*HTTP Response.*?\\*\\'" :regexp t :align t :close-on-realign t :size 20 :select nil)
              (" *Agenda Commands*" :align t :close-on-realign t :size 20 :select nil)
              ("\\`\\*Org Agenda.*?\\*\\'" :regexp t :align t :close-on-realign t :size 0.33 :select nil)
              ('ansi-term-mode :align t :close-on-realign t :size 0.4 :select t)
              ('occur-mode :align t :close-on-realign t :size 0.4 :select nil)
              ('grep-mode :align t :close-on-realign t :size 0.4 :select nil)
              ('ag-mode :align t :close-on-realign t :size 0.4 :select nil)
              ('term-mode :align t :close-on-realign t :size 0.4 :select t)
              ('shell-mode :align t :close-on-realign t :size 0.4 :select t)
              ('eshell-mode :align t :close-on-realign t :size 0.4 :select t)
              ('magit-status-mode :align t :close-on-realign t :size 0.33 :select t)
              ('magit-revision-mode :align t :close-on-realign t :size 0.33 :select t)
              ('magit-log-mode :align t :close-on-realign t :size 0.33 :select t)
              ('completion-list-mode :align t :close-on-realign t :size 0.33 :select t)
              ('compilation-mode :align t :close-on-realign t :size 0.33 :select t)
              ('inferior-scheme-mode :align t :close-on-realign t :size 0.33 :select t)
              ("*Warnings*" :align t :close-on-realign t :size 0.33 :select nil)
              ("*Messages*" :align t :close-on-realign t :size 0.33 :select nil)
              ('dired-mode :align t :close-on-realign t :size 0.33 :select t)))

      ;; Ensure Helm doesn't interfere with Shackle buffers too much.
      ;; - Use Shackle to control and position Helm buffers.
      ;; - But ensure that shackle-last-buffer is not set to any Helm buffer.
      ;;
      ;; TODO - ideally Helm would cleanup buffers immediately to avoid
      ;; interfering with other buffer display commands.
      (setq helm-display-function 'pop-to-buffer) ; make sure helm popups are detected.
      (defvar md/shackle-buffer-store nil)
      (defvar md/shackle-window-store nil)
      (defun md/helm-shackle-setup ()
        (setq md/shackle-buffer-store shackle-last-buffer
              md/shackle-window-store shackle-last-window))
      (defun md/helm-shackle-teardown ()
        (when md/shackle-buffer-store
          (setq shackle-last-buffer md/shackle-buffer-store
                shackle-last-window md/shackle-window-store)))
      (add-hook 'helm-before-initialize-hook 'md/helm-shackle-setup)
      (add-hook 'helm-cleanup-hook 'md/helm-shackle-teardown)

      ;; NOTE: In order to get Shackle working with some org-mode commands, we
      ;; have to override an internal function. Org is quite opinionated about
      ;; window display, and usually this function will unset various buffer
      ;; display variables before calling switch-to-buffer-other-window.
      ;; I'd rather just control those buffers with Shackle.
      (fmakunbound 'org-switch-to-buffer-other-window)
      (defun org-switch-to-buffer-other-window (&rest args)
        (apply 'switch-to-buffer-other-window args))
      (setq org-agenda-window-setup 'other-window)

      (shackle-mode 1))

    :bind (:map md/leader-map
                ("; ;" . display-buffer)  ;; Uses display-buffer-alist, so Shackle rules will apply.
                (";a" . md/shackle-toggle)))
#+END_SRC


** Dedicated

I'm inlining this because it's so small. Allows toggling of "dedicated" status
for windows using ~set-window-dedicated-p~, which prevents Emacs from displaying
another buffer in the window.

#+BEGIN_SRC emacs-lisp
  ;; Copyright (C) 2000 Eric Crampton <eric@atdesk.com>
  ;; https://github.com/emacsorphanage/dedicated
  ;; GPL v2.

  (defvar dedicated-mode nil
    "Mode variable for dedicated minor mode.")
  (make-variable-buffer-local 'dedicated-mode)

  (defun dedicated-mode (&optional arg)
    "Dedicated minor mode."
    (interactive "P")
    (setq dedicated-mode (not dedicated-mode))
    (set-window-dedicated-p (selected-window) dedicated-mode)
    (if (not (assq 'dedicated-mode minor-mode-alist))
        (setq minor-mode-alist
              (cons '(dedicated-mode " D")
                    minor-mode-alist))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (bind-key "tD" 'dedicated-mode md/leader-map)
#+END_SRC


** Narrowing

Add a narrow/widen dwim command, inspired by http://endlessparentheses.com/emacs-narrow-or-widen-dwim.html:

#+BEGIN_SRC emacs-lisp
  ;; Don't ask for confirmation on narrow-to-region
  (put 'narrow-to-region 'disabled nil)

  (bind-key "n" narrow-map md/leader-map)
  (bind-key "i" 'org-tree-to-indirect-buffer narrow-map)
  (bind-key "f" 'md/narrow-dwim narrow-map)
  (bind-key "r" 'narrow-to-region narrow-map)  ; Duplicate this, I think "r" works
                                          ; better than "n" for narrow-to-region

  (defun md/narrow-dwim (p)
    "Widen if buffer is narrowed, narrow-dwim otherwise.
    Dwim means: region, org-src-block, org-subtree, or
    defun, whichever applies first. Narrowing to
    org-src-block actually calls `org-edit-src-code'.

    With prefix P, don't widen, just narrow even if buffer
    is already narrowed."
    (interactive "P")
    (declare (interactive-only))
    (cond ((and (buffer-narrowed-p) (not p)) (widen))
          ((region-active-p)
           (narrow-to-region (region-beginning)
                             (region-end)))
          (org-src-mode
           (org-edit-src-exit))
          ((derived-mode-p 'org-mode)
           ;; `org-edit-src-code' is not a real narrowing
           ;; command. Remove this first conditional if
           ;; you don't want it.
           (cond ((ignore-errors (org-edit-src-code) t))
                 ((ignore-errors (org-narrow-to-block) t))
                 (t (org-narrow-to-subtree))))
          ((derived-mode-p 'latex-mode)
           (LaTeX-narrow-to-environment))
          (t (narrow-to-defun))))

#+END_SRC

* Org mode

** use-package wrapper *START*

I'm putting all this setup in use-package, but still want to split into separate
org headings:

#+BEGIN_SRC emacs-lisp
  (use-package org
    :defer 5
    :config
    (progn
#+END_SRC

** General setup

#+BEGIN_SRC emacs-lisp
  (defun md/org-hook ()
    ;; Change tab widths to fit headline indents
    (setq tab-width 2
          evil-shift-width 2)

    ;; Disable in-buffer line numbers and the colour column, as both decrease
    ;; org-mode / outline performance significantly on large files.
    (linum-mode 0)
    (fci-mode 0)

    ;; Also disable the row and column numbers in the modeline. Seems you have to set
    ;; these manually to make them buffer-local.
    (setq-local line-number-mode nil)
    (setq-local column-number-mode nil)

    ;; Also don't highlight the current line. For some reason this requires making
    ;; global-hl-line-mode buffer-local.
    (make-variable-buffer-local 'global-hl-line-mode)
    (setq-local global-hl-line-mode nil))
  (add-hook 'org-mode-hook 'md/org-hook)

  (setq
        ;; Whether to let org-agenda permanently mess with window layout
        org-agenda-restore-windows-after-quit nil

        ;; I'm trying this to decrease wait times for the agenda windows
        org-agenda-sticky t

        ;; I find this more intuitive
        org-indirect-buffer-display 'current-window

        ;; Add timestamp when set task as closed
        org-log-done 'time

        ;; Colour the whole headline
        org-level-color-stars-only nil

        ;; Colour done headlines to make them less prominent
        org-fontify-done-headline t

        ;; Try to prevent accidentally editing invisible lines
        org-catch-invisible-edits 'show-and-error

        ;; Don't indent things for nested headings (eg. properties)
        org-adapt-indentation nil

        org-clock-out-remove-zero-time-clocks t

        ;; If press M-RET I want a new line, not to split the line
        org-M-RET-may-split-line nil)

  ;; Goto and refile
  (setq
        ;; For org-goto, use helm rather than the weird default interface
        ;; where you search through the file
        org-goto-interface 'outline-path-completion

        ;; For org-goto, search all nodes rather than forcing me to start with
        ;; the top level heading and then search the children etc.
        org-outline-path-complete-in-steps nil

        ;; For org-goto and org-refile, show the outline path during Helm
        ;; completion rather than just the headline.
        org-refile-use-outline-path t

        ;; Include nested items in org-refile.
        org-refile-targets '((nil :maxlevel . 9)))


  ;; Only two priorities - default and flagged
  (setq org-highest-priority 65)
  (setq org-lowest-priority 66)
  (setq org-default-priority 66)

  (bind-key "C-c d" 'md/org-timestamp-date-inactive-no-confirm org-mode-map)
  (bind-key "C-c t" 'md/org-timestamp-time-inactive-no-confirm org-mode-map)
  (bind-key "C-c l" 'md/org-insert-link-from-paste org-mode-map)
#+END_SRC

