emacs.d.symlink/init.el

(defun md/org-hook ()
  ;; Change tab widths to fit headline indents
  (setq tab-width 2
        evil-shift-width 2)

  ;; Disable in-buffer line numbers and the colour column, as both decrease
  ;; org-mode / outline performance significantly on large files.
  (linum-mode 0)
  (fci-mode 0)

  ;; Also disable the row and column numbers in the modeline. Seems you have to set
  ;; these manually to make them buffer-local.
  (setq-local line-number-mode nil)
  (setq-local column-number-mode nil)

  ;; Also don't highlight the current line. For some reason this requires making
  ;; global-hl-line-mode buffer-local.
  (make-variable-buffer-local 'global-hl-line-mode)
  (setq-local global-hl-line-mode nil))
(add-hook 'org-mode-hook 'md/org-hook)

(setq
      ;; Don't let org-agenda permanently mess with window layout
      org-agenda-restore-windows-after-quit t

      ;; I find this more intuitive
      org-indirect-buffer-display 'current-window

      ;; Add timestamp when set task as closed
      org-log-done 'time

      ;; Colour the whole headline
      org-level-color-stars-only nil

      ;; Colour done headlines to make them less prominent
      org-fontify-done-headline t

      ;; Try to prevent accidentally editing invisible lines
      org-catch-invisible-edits 'show-and-error

      ;; Don't indent things for nested headings (eg. properties)
      org-adapt-indentation nil

      org-clock-out-remove-zero-time-clocks t

      ;; If press M-RET I want a new line, not to split the line
      org-M-RET-may-split-line nil)

;; Goto and refile
(setq
      ;; For org-goto, use helm rather than the weird default interface
      ;; where you search through the file
      org-goto-interface 'outline-path-completion

      ;; For org-goto, search all nodes rather than forcing me to start with
      ;; the top level heading and then search the children etc.
      org-outline-path-complete-in-steps nil

      ;; For org-goto and org-refile, show the outline path during Helm
      ;; completion rather than just the headline.
      org-refile-use-outline-path t

      ;; Include nested items in org-refile.
      org-refile-targets '((nil :maxlevel . 9)))


;; Only two priorities - default and flagged
(setq org-highest-priority 65)
(setq org-lowest-priority 66)
(setq org-default-priority 66)

(bind-key "C-c d" 'md/org-timestamp-date-inactive-no-confirm org-mode-map)
(bind-key "C-c t" 'md/org-timestamp-time-inactive-no-confirm org-mode-map)
(bind-key "C-c l" 'md/org-insert-link-from-paste org-mode-map)
