emacs.d.symlink/init.el

(defvar md/org-inherit-dates-p t
  "Used by a couple of my util functions, eg. md/org-skip-if-deadline-in-days.")

(defun md/org-timestamp-time-inactive-no-confirm ()
  "Insert inactive time timestamp without prompting the user"
  (interactive)
  (org-insert-time-stamp (current-time) t t))

(defun md/org-timestamp-date-inactive-no-confirm ()
  "Insert inactive date timestamp without prompting the user"
  (interactive)
  (org-insert-time-stamp (current-time) nil t))

(defun md/org-insert-link-from-paste ()
  "Perform org-insert-link with the current contents of the clipboard"
  (interactive)
  (org-insert-link nil
                   (with-temp-buffer
                     (evil-paste-after nil)
                     (delete-trailing-whitespace)
                     (buffer-string))))


(defun md/org-back-to-top-level-heading ()
  "Go back to the current top level heading."
  (interactive)
  (or (re-search-backward "^\* " nil t)
      (goto-char (point-min))))

(defun md/org-get-priority (inherit)
  "Get priority for the current line. If inherit is t, retrieve
priority from the closest parent headline"
  (if (not inherit)
      (org-get-priority (thing-at-point 'line))
    (save-excursion
      (let ((keep-searching t))
        (while keep-searching
          (if (string-match org-priority-regexp (thing-at-point 'line))
              (setq keep-searching nil)
            (setq keep-searching (org-up-heading-safe))))
        (org-get-priority (thing-at-point 'line))))))

(defun md/org-agenda-skip-rtn-point ()
  "If you customise org-agenda-skip-function, your skip function has to return
the point at which you want the agenda to continue processing the file. In my
  case I always want this to be the end of the subtree."
  (org-end-of-subtree t)
  (point))

(defun md/org-skip-if-deadline-in-days (user-fn)
  "A utility function that can be used for org-agenda-skip-function. It calls
  `(user-fn number-of-days-until-deadline)`. If `user-fn` returns a `t` value,
  the agenda item will be skipped. 

  You could use this to eg. skip all items that have a deadline
  in more than 60 days by running as part of your config:

  '(org-agenda-skip-function
      '(md/org-skip-if-deadline-in-days (lambda (d) (if (eq d nil) t (> d 60)))))
  "
  (save-excursion
    (let* ((deadline-time (org-get-deadline-time (point)
                                                    md/org-inherit-dates-p))
           (days (if deadline-time
                     (time-to-number-of-days
                      (time-subtract deadline-time (org-current-effective-time))))))
        (if (funcall user-fn days)  ; Returns t if we should skip
            (md/org-agenda-skip-rtn-point))
        )))

(defun md/org-skip-if-scheduled-in-days (user-fn)
  "This function is just like org-skip-if-deadline-in-days, but
uses the scheduled property rather than the deadline."
  (save-excursion
    (let* ((scheduled-time (org-get-scheduled-time (point)
                                                    md/org-inherit-dates-p))
           (days (if scheduled-time
                     (time-to-number-of-days
                      (time-subtract scheduled-time (org-current-effective-time))))))
        (if (funcall user-fn days)  ; Returns t if we should skip
            (md/org-agenda-skip-rtn-point))
        )))

(defun md/org-skip-if-priority-level (user-fn)
  "Utility function that can be used for org-agenda-skip-function. It calls
  `(user-fn priority-level`). If `user-fn` returns a `t` value, the agenda item
  will be skipped. If the item doesn't have a priority assigned, the level used
  is 0.

  You could use this to eg. skip all items that don't have a priority:

  '(org-agenda-skip-function
       '(md/org-skip-if-priority-level (lambda (p) (<= p 0))))
  "
  (save-excursion
    (if (funcall user-fn (md/org-get-priority t))
        (md/org-agenda-skip-rtn-point))))

(defun md/org-skip-if-not-match-parent-kwd (keyword)
  "Utility function that can be used for org-agenda-skip-function. It searches
  parents of the current node for a matching keyword. If the match isn't found,
  it returns the skip point expected by org-agenda-skip-function.
  "
  (save-excursion
    (let (top bottom)
        (setq bottom (save-excursion (org-end-of-subtree t) (point)))
        (setq top (save-excursion (md/org-back-to-top-level-heading) (point)))
        (if 
            (re-search-backward (format org-heading-keyword-regexp-format keyword) top t) 
            nil
        (md/org-agenda-skip-rtn-point))
        )))

(define-minor-mode md/evil-org-mode
  "Buffer local minor mode for evil-org"
  :init-value nil
  :lighter " EvilOrg"
  :keymap (make-sparse-keymap) ; defines md/evil-org-mode-map
  :group 'md/evil-org)

;; Normal state shortcuts
(evil-define-key 'normal md/evil-org-mode-map
  "gk" 'outline-previous-visible-heading
  "gj" 'outline-next-visible-heading
  "H" 'org-beginning-of-line
  "L" 'org-end-of-line
  "$" 'org-end-of-line
  "^" 'org-beginning-of-line
  "-" 'org-cycle-list-bullet
  (kbd "RET") 'org-cycle
  (kbd "TAB") 'org-cycle)

;; Normal and insert state shortcuts.
(mapc (lambda (state)
        (evil-define-key state md/evil-org-mode-map
          (kbd "M-l") 'org-metaright
          (kbd "M-h") 'org-metaleft
          (kbd "M-k") 'org-metaup
          (kbd "M-j") 'org-metadown
          (kbd "M-L") 'org-shiftmetaright
          (kbd "M-H") 'org-shiftmetaleft
          (kbd "M-K") 'org-shiftmetaup
          (kbd "M-J") 'org-shiftmetadown
          ))
      '(normal insert))

(add-hook 'org-mode-hook 'md/evil-org-mode)

(define-minor-mode md/evil-org-agenda-mode
  "Buffer local minor mode for evil-org-agenda"
  :init-value nil
  :lighter " EvilOrgAgenda"
  :keymap (make-sparse-keymap) ; defines md/evil-org-agenda-mode-map
  :group 'md/evil-org-agenda)

(evil-set-initial-state 'org-agenda-mode 'normal)

(evil-define-key 'normal md/evil-org-agenda-mode-map
  ;; j / k
  (kbd "j") 'org-agenda-next-line
  (kbd "n") 'org-agenda-next-line
  (kbd "C-n") 'org-agenda-next-line
  (kbd "k") 'org-agenda-previous-line
  (kbd "p") 'org-agenda-previous-line
  (kbd "C-p") 'org-agenda-previous-line

  (kbd "q") 'org-agenda-quit
  (kbd "r") 'org-agenda-redo  ; Recalculate the agenda
  (kbd "v") 'org-agenda-view-mode-dispatch  ; Alter the view
  (kbd "|") 'org-agenda-filter-remove-all  ; Remove existing filters
  (kbd "=") 'org-agenda-filter-by-regexp  ; Search
  (kbd "C-/") 'org-agenda-filter-by-tag  ; Tag filter
  (kbd "^") 'org-agenda-filter-by-top-headline  ; Show other items with same
                                    ; headline as current
  (kbd "A") 'org-agenda-append-agenda)  ; Add another agenda

(add-hook 'org-agenda-mode-hook 'md/evil-org-agenda-mode)
