emacs.d.symlink/init.org
** helm-org

General Helm command to work on headlines. This is similar to
~helm-org-in-buffer-headings~, but I'm having trouble getting that function to
adhere to ~helm-org-format-outline-path~.

#+BEGIN_SRC emacs-lisp
  (require 'helm-org)  ; this is part of the helm source but not loaded by default

  (setq helm-org-format-outline-path nil)
  (setq helm-org-headings-fontify t)

  (defun md/helm-org ()
    "Open org headlines in helm."
    (interactive)
    (let* ((src (helm-build-sync-source "Org headings"
                  :candidates (helm-org-get-candidates (file-expand-wildcards buffer-file-name))
                  :action '(("Go to heading" . helm-org-goto-marker)
                            ("Open in indirect buffer" . helm-org--open-heading-in-indirect-buffer)
                            ("Refile to this heading" . helm-org-heading-refile)
                            ("Insert link to this heading" . helm-org-insert-link-to-heading-at-marker))))
           (cmd (helm :sources '(src))))))
#+END_SRC

** Babel / code
#+BEGIN_SRC emacs-lisp
    ;; Load some language support
    (require 'ob-restclient)
    (require 'ob-python)
    (require 'ob-C)
    (require 'ob-go)

  (setq
   ;; Fontify inline code
   org-src-fontify-natively t

   ;; When editing code, I don't want to open another window. This
   ;; just makes the screen tidier.
   org-src-window-setup 'current-window

   ;; tab / indentation is the main reason I would use C-' so prevent it if possible
   org-src-tab-acts-natively t)
#+END_SRC
** Exports
#+BEGIN_SRC emacs-lisp
  (setq org-export-headline-levels 6
        org-export-with-section-numbers 4)
#+END_SRC

Export org-mode files to reveal.js for presentations. I think this works
quite nicely:

#+BEGIN_SRC emacs-lisp
  (use-package ox-reveal)
#+END_SRC

** org-gcal
#+BEGIN_SRC emacs-lisp
  (defun md/org-gcal-fetch ()
    "Always refresh gcal token before fetching, as it expires every hour"
    (interactive)
    (ignore-errors ;; Error is thrown if token doesn't already exist in the gcal file
      (org-gcal-refresh-token))
    (sleep-for 1)
    (org-gcal-fetch))

  (use-package org-gcal
    :config
    (progn
      (setq

       ;; Don't archive entries to a separate file
       org-gcal-auto-archive nil

       org-gcal-down-days 120
       org-gcal-up-days 120)))
#+END_SRC
** Reviews
#+BEGIN_SRC emacs-lisp
  (defconst md/org-review-property "LAST_REVIEWED"
    "I use this in a few places to keep track of when I lasted reviewed particular
  headlines")

  (defun org-review ()
    "Set the LAST_REVIEWED property to the current date/time"
    (interactive)
    (org-set-property md/org-review-property ; currently this is LAST_REVIEWED
                      (with-temp-buffer
                        (org-insert-time-stamp (current-time) nil t)))) ; Inactive stamp

  (define-key org-mode-map (kbd "C-c C-r") 'org-review)
#+END_SRC
** Global bindings
#+BEGIN_SRC emacs-lisp
  (bind-key "C-c a" 'org-agenda global-map)
#+END_SRC
** use-package wrapper *END*
Close the use-package wrapper:

#+BEGIN_SRC emacs-lisp
))
#+END_SRC

* Bookmarks
#+BEGIN_SRC emacs-lisp
  (bind-key "Bj" 'bookmark-jump md/leader-map)
  (bind-key "Bs" 'bookmark-set md/leader-map)
  (bind-key "Bd" 'bookmark-delete md/leader-map)
#+END_SRC
* Scratch

Use some persistent scratch files for various modes:

#+BEGIN_SRC emacs-lisp
  (defconst md/scratch-file-elisp "~/.emacs-scratch.el")
  (defun md/scratch-open-file-elisp ()
    (interactive)
    (find-file md/scratch-file-elisp))

  (defconst md/scratch-file-python "~/.emacs-scratch.py")
  (defun md/scratch-open-file-python ()
    (interactive)
    (find-file md/scratch-file-python))

  (defconst md/scratch-file-restclient "~/.emacs-scratch.http")
  (defun md/scratch-open-file-restclient ()
    (interactive)
    (find-file md/scratch-file-restclient))

  (defconst md/scratch-file-markdown "~/.emacs-scratch.md")
  (defun md/scratch-open-file-markdown ()
    (interactive)
    (find-file md/scratch-file-markdown))

  (defconst md/scratch-file-gfm "~/.emacs-scratch.gfm")
  (defun md/scratch-open-file-gfm ()
    (interactive)
    (find-file md/scratch-file-gfm))

  (defconst md/scratch-file-org "~/.emacs-scratch.org")
  (defun md/scratch-open-file-org ()
    (interactive)
    (find-file md/scratch-file-org))

  ;; Open this scratch buffer on startup
  (setq initial-buffer-choice md/scratch-file-org)

  (bind-key "'s" 'md/scratch-open-file-elisp md/leader-map) 
  (bind-key "'e" 'md/scratch-open-file-elisp md/leader-map)
  (bind-key "'p" 'md/scratch-open-file-python md/leader-map)
  (bind-key "'r" 'md/scratch-open-file-restclient md/leader-map)
  (bind-key "'m" 'md/scratch-open-file-markdown md/leader-map)
  (bind-key "'g" 'md/scratch-open-file-gfm md/leader-map)
  (bind-key "'o" 'md/scratch-open-file-org md/leader-map)
#+END_SRC
* Modeline
** General modeline
#+BEGIN_SRC emacs-lisp
(line-number-mode 1)
(column-number-mode 1)
#+END_SRC

