emacs.d.symlink/init.org
** Powerline
#+BEGIN_SRC emacs-lisp
  (use-package powerline
   :defer 1
   :config
   (progn
     (defface md/powerline-inactive '((t (:inherit 'modeline))) "")
     (defface md/powerline-normal '((t (:inherit 'modeline))) "")
     (defface md/powerline-insert '((t (:inherit 'modeline))) "")
     (defface md/powerline-visual '((t (:inherit 'modeline))) "")
     (defface md/powerline-replace '((t (:inherit 'modeline))) "")
     (defface md/powerline-emacs '((t (:inherit 'modeline))) "")
     (defun md/powerline-setup ()
       (interactive)
       (require 'flycheck)
       (setq-default mode-line-format
                     '("%e"
                       (:eval
                        (let* ((active (powerline-selected-window-active))
                               (mode-line (if active 'mode-line 'mode-line-inactive))
                               (face1 (if active 'powerline-active1 'powerline-inactive1))
                               (face2 (if active 'powerline-active2 'powerline-inactive2))

                               ;; Set face3 depending on Evil state
                               (face3 (if active
                                          (cond ((evil-normal-state-p) 'md/powerline-normal)
                                                ((evil-insert-state-p) 'md/powerline-insert)
                                                ((evil-visual-state-p) 'md/powerline-visual)
                                                ((evil-replace-state-p) 'md/powerline-replace)
                                                ((evil-emacs-state-p) 'md/powerline-emacs)
                                                (t 'md/powerline-normal))
                                        'md/powerline-inactive))
                               (separator-left (intern (format "powerline-%s-%s"
                                                               (powerline-current-separator)
                                                               (car powerline-default-separator-dir))))
                               (separator-right (intern (format "powerline-%s-%s"
                                                                (powerline-current-separator)
                                                                (cdr powerline-default-separator-dir))))

                               (lhs (list
                                     ;; Line / column numbers
                                     (when (or line-number-mode column-number-mode)
                                       (cond ((and line-number-mode
                                                   column-number-mode)
                                              (powerline-raw "%4l:%2c " face3 'l))
                                             (line-number-mode
                                              (powerline-raw "%4l" face3 'l))
                                             (column-number-mode
                                              (powerline-raw ":%2c " face3 'l))))

                                     ;; Dedicated mode indicator
                                     (when dedicated-mode
                                       (powerline-raw (format "Ded.") face3 'l))

                                     ;; Evil status
                                     (powerline-raw evil-mode-line-tag face3 'l)
                                     (funcall separator-left face3 face1)

                                     ;; Major mode
                                     (powerline-raw (format "%s " (powerline-major-mode)) face1 'l)
                                     (funcall separator-left face1 mode-line)

                                     ;; Projectile project
                                     (if (and (boundp 'projectile-mode) projectile-mode)
                                         (powerline-raw (concat (projectile-project-name) "::%b") 'l)
                                       (powerline-raw "%b" mode-line 'l))

                                     ;; File state
                                     (when (buffer-modified-p)
                                       (powerline-raw "+" mode-line 'l))
                                     (when buffer-read-only
                                       (powerline-raw "[RO]" mode-line 'l))
                                     (when (buffer-narrowed-p)
                                       (powerline-raw "  Narrow" mode-line 'l))
                                     (when (and active (fboundp 'org-clocking-p) (org-clocking-p))
                                       (powerline-raw
                                        (propertize
                                         (format "  %s "
                                                 (if (> (length org-mode-line-string) 50)
                                                     (format "%s..." (string-trim (substring org-mode-line-string 0 50)))
                                                   org-mode-line-string))
                                         'face nil)
                                        mode-line 'l))))

                               (rhs (list

                                     ;; Git
                                     (funcall separator-right mode-line face1)
                                     (powerline-vc face1 'r)

                                     ;; Flycheck
                                     (when (and active flycheck-mode (flycheck-has-current-errors-p))
                                       (powerline-raw
                                        (format " [line:%s (%s)] "
                                                ;; Line of first err
                                                (save-excursion
                                                  (flycheck-first-error)
                                                  (+ 1 (count-lines (point-min) (point))))
                                                ;; Total lines
                                                (length flycheck-current-errors))

                                        ;; Face
                                        (cond ((flycheck-has-current-errors-p 'error)
                                               'md/modeline-flycheck-error)
                                              ((flycheck-has-current-errors-p 'warning)
                                               'md/modeline-flycheck-warning))
                                        'r))
                                     )))
                          (concat (powerline-render lhs)
                                  (powerline-fill mode-line (powerline-width rhs))
                                  (powerline-render rhs)))))))

     (defun md/powerline-reset ()
       (interactive)
       (setq mode-line-format (md/powerline-setup))
       (solarized-load-theme))

     (md/powerline-setup)
     (md/powerline-reset)))
#+END_SRC
* Solarized theme

#+BEGIN_SRC emacs-lisp
  (use-package color-theme-solarized
   :demand t
   :ensure nil
   :load-path "non-elpa/color-theme-solarized"
   :config
   (progn
     (add-to-list 'custom-theme-load-path "non-elpa/color-theme-solarized")

     ;; Necessary on v24.4 to display accurate Solarized colors, due to Emacs bug
     ;; #8402. v24.3 didn't set ns-use-sgrb-colorspace.
     (setq ns-use-srgb-colorspace nil
           solarized-broken-srgb t)

     ;; See heading on terminal colour fixes near top of file
     (when (not (display-graphic-p))
       (setq solarized-bold nil))

     (load-theme 'solarized t)  ; Defaults to light
     (solarized-enable-theme 'dark))

   :bind (:map md/leader-map
          ("ts" . solarized-toggle-theme-mode)
          ("cs" . solarized-toggle-comment-visibility)))
#+END_SRC

