emacs.d.symlink/init.org
* Writeroom

Remove writing distractions:

#+BEGIN_SRC emacs-lisp
  (use-package writeroom-mode
   :defer 1
   :demand t
   :config
   (progn
     (setq writeroom-width 90)

     (defun md/handle-elscreen (arg)
       (cond
        ((= arg 1)
         (setq elscreen-display-tab nil)
         (elscreen-notify-screen-modification 'force))
        ((= arg -1)
         (setq elscreen-display-tab t)
         (elscreen-notify-screen-modification 'force))))

     (add-to-list 'writeroom-global-effects 'md/handle-elscreen))

   :bind (:map md/leader-map
          ("tW" . writeroom-mode)))
#+END_SRC

* Dotfiles

#+BEGIN_SRC emacs-lisp
  (defun md/dotfiles-edit-init ()
    (interactive)
    (find-file (md/dotfiles-get-path "emacs.d.symlink/init.org")))

  (bind-key "ve" 'md/dotfiles-edit-init md/leader-map)
  (bind-key "vc" 'md/dotfiles-compile md/leader-map)
#+END_SRC

** Secrets / Local setup
Sometimes I want machine-specific setup:

#+BEGIN_SRC emacs-lisp
  (defconst md/dotfiles-init-local-path "~/.local.el")

  (when (file-exists-p md/dotfiles-init-local-path)
        (load-file md/dotfiles-init-local-path))

  (defun md/dotfiles-edit-init-local ()
    (interactive)
    (find-file md/dotfiles-init-local-path))

  (bind-key "vl" 'md/dotfiles-edit-init-local md/leader-map)
#+END_SRC

* Profile Emacs startup

Running ~esup~ will start Emacs and profile the startup time. To get GUI on par
w/terminal, I can disable exec-path-from-shell.

#+BEGIN_SRC emacs-lisp
(use-package esup
  :defer 5)
#+END_SRC

* Server
#+BEGIN_SRC emacs-lisp
(require 'server)
(when (not (server-running-p))
   (server-start))
#+END_SRC

* Teardown

Profiling. This number comes out slightly different to ~(emacs-init-time)~

#+BEGIN_SRC emacs-lisp
(defconst md/emacs-init-end (current-time))

(defconst md/emacs-boot-time (float-time (time-subtract md/emacs-init-end md/emacs-init-start)))
(message (format "md/emacs-boot-time: %s" md/emacs-boot-time))

#+END_SRC

Close paren for the wrapping ~let~:

#+BEGIN_SRC emacs-lisp
)
#+END_SRC

* TODO
- [ ] tab key not inserting tabs in evil?
  - it aligns but doesn't insert tab, not sure if this is behaviour i want. It
    runs indent-for-tab-command. Try it for a while.
- [ ] read electric-indent docs.
- [ ] does electric-indent need different configuration in python? I used to
  have something for this.
- [ ] info / other help modes - use vi keys to navigate?
- [ ] how to preserve binding in map?
  - Eg. I want to use normal mode for some magit modes, but I generally want to retain
    the behaviour of RET. This is true for help modes too.
- [ ] jumping to definitions
  - Under cursor, and by name
- [ ] finding uses of functions
  - Under cursor, and by name
- [ ] debugger
  - [2017-03-17 Fri] get similar bindings to pudb?
- [ ] folding
  - I basically want tab/shift+tab toggle bindings like outline mode. But
    outline mode doesn't match folding blocks nicely, so need to use another package.
- [ ] checkout slime
- [ ] jumping forward/back to markers including between files
- [ ] https://github.com/emacs-tw/awesome-emacs
  - [ ] multi cursor?
- [ ] gk/gj for next/prev functions
- [ ] [2016-08-20 Sat] getting helm "operator" keymap error in fundamental mode.
- [ ] python development / elpy
  - [ ] open documentation
  - [ ] run tests
  - [ ] refactoring
- [ ] the elpy flycheck colours aren't bad, and work in terminal - consider
  using them for full flycheck.
- [ ] check company addons
- [ ] go mode
- [ ] cask?
- [2016-09-24 Sat] elscreen not actively developed
- [ ] spacemacs - provide anything good?
  - [ ] paradox-list-packages
  - [ ] a prefix - applications
  - [ ] list-processes?
  - [ ] undo tree visualiser?
  - [ ] ! to execute shell command
  - [ ] c - compiling
    - helm-make-projectile
    - helm-make
    - compile
    - recompile
    - projectile-compile is under
  - [ ] f - file prefix
    - dired jump
    - open in external app
    - neotree toggle looks cool
  - [ ] i - insert prefix
  - [ ] p - projectile run shell
    - and async
    - projectile-compile
    - multi-occur
    - neotree
  - [ ] q - some quit functions
    - kill-emacs
    - restart-emacs-resume-layouts?
  - [ ] s - search prefix
    - "smart" search?
  - [ ] S - symbol highlight. Is this useful?
  - [ ] t / T - various toggles, eg. linum, line wrapping. Perhaps solarized bg mode.
  - [ ] w - window commands. The popup window looks like it might be good
    - for messages, compiling, generally temp stuff.
  - [ ] z - zoom text
- [ ] helm-all-mark-rings?
- [ ] check spacemacs - are there any modes we can evilify? eg. some of the help modes.
- [ ] python shell / inferior?
- [ ] getting slowdowns where python3 uses 99% cpu. Seems to occcur sometimes
  when killing buffers. Only python processes running are doing ~elpy.__main__~.
  - This process is started in elpy-rpc--open.
  - https://github.com/jorgenschaefer/elpy/issues/724
  - Next time this happens use strace and try to report bug.
  - https://github.com/jorgenschaefer/elpy/issues/96
- [ ] info page for intro to emacs lisp
- [ ] browse documentation?
  - for eg. ansible
- [ ] [2017-03-18 Sat] get C-O/C-I jumping forward/back in dired.
- [ ] helm buffers - how to search including the mode? Eg. "dired" should match
  the "Dired by name" buffers.
- [ ] enable SPC leader in ag-mode.
- [2016-12-01 Thu] does evil-add-hjkl-bindings take precedence over the mode
  map?
- [2016-12-03 Sat] https://bitbucket.org/lyro/evil/issues/511/let-certain-minor-modes-key-bindings
- [ ] [2016-12-07 Wed] profile CPU issues
  - It's probably a package that slows down org mode
- [ ] [2017-02-28 Tue] org links to files, shortcuts.
- [ ] [2017-03-19 Sun] bindings or bookmarks to jump to elisp source files (eg. elpa)
- [ ] [2017-03-17 Fri] splitscreen - C-w q to close window?
- [ ] [2017-03-18 Sat] ensure backup files are working properly
- [ ] [2017-03-18 Sat] how to ensure evil-set-jump is called in help-mode?
- [ ] [2017-03-18 Sat] how to ensure evil-set-jump is called in dired-mode?
- [ ] [2017-03-23 Thu] list functions/classes in project?
- [ ] [2017-03-24 Fri] how to do proper logging? Write library?
- [ ] [2017-03-24 Fri] still C-o not getting enough checkpoints.
- [ ] [2017-03-23 Thu] function for replacing "\n" with actual newlines.
- [ ] [2017-03-27 Mon] - C-spc binding should be included in which-key? So it's
  used as prefix but then you can access the original binding.
- [ ] [2017-03-25 Sat] https://github.com/redguardtoo/evil-matchit.
- [ ] [2017-04-28 Fri] org - display inline images?
- [ ] [2017-05-06 Sat] org - get babel working for scheme
- [ ] [2017-05-18 Thu] ansi-term - fix backspace in insert mode
- [ ] [2017-05-18 Thu] ansi-term - get C-r and my usual C-n/C-p bindings?
- [ ] [2017-03-23 Thu] use dumb-jump for easy jumping to definitions??
  - by default only works within a project, won't search eg. python libs.
- [ ] [2017-05-22 Mon] https://github.com/syohex/emacs-quickrun
- [ ] [2017-07-04 Tue] helm - any way to cleanup old helm buffers?
  - otherwise maybe auto-kill them if we do prev/next buffer.
- [ ] [2017-07-04 Tue] Way to output org-babel results to buffer?
- [ ] [2017-07-05 Wed] bindings for old popwin standalone apps
  - dired, terminal, magit?
