emacs.d.symlink/init.el

(use-package writeroom-mode
 :defer 1
 :demand t
 :config
 (progn
   (setq writeroom-width 90)

   (defun md/handle-elscreen (arg)
     (cond
      ((= arg 1)
       (setq elscreen-display-tab nil)
       (elscreen-notify-screen-modification 'force))
      ((= arg -1)
       (setq elscreen-display-tab t)
       (elscreen-notify-screen-modification 'force))))

   (add-to-list 'writeroom-global-effects 'md/handle-elscreen))

 :bind (:map md/leader-map
        ("tW" . writeroom-mode)))

(defun md/dotfiles-edit-init ()
  (interactive)
  (find-file (md/dotfiles-get-path "emacs.d.symlink/init.org")))

(bind-key "ve" 'md/dotfiles-edit-init md/leader-map)
(bind-key "vc" 'md/dotfiles-compile md/leader-map)

(use-package esup
  :defer 5)

(require 'server)
(when (not (server-running-p))
   (server-start))

(when (file-exists-p "~/.secrets.el")
      (load-file "~/.secrets.el"))

(defconst md/emacs-init-end (current-time))

(defconst md/emacs-boot-time (float-time (time-subtract md/emacs-init-end md/emacs-init-start)))
(message (format "md/emacs-boot-time: %s" md/emacs-boot-time))

)
